2023-07/deep-reinforcement-learning/RL_test_cases/rayleigh_benard_cell/physics-simulation-engine/fluid-openfoam/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
32130
(
2.92542e-07
-1.89706e-07
4.75721e-07
-1.83179e-07
6.48379e-07
-1.72658e-07
8.06943e-07
-1.58563e-07
...
)
;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 0;
    }
    ceiling
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0
0
0
0
0
0
0
0
...
)
;
    }
    leftWall
    {
        type            cyclic;
        value           nonuniform List<scalar> 
90
(
-1.02835e-07
-3.06755e-07
-5.13447e-07
-7.22235e-07
-9.32394e-07
-1.14318e-06
-1.35385e-06
-1.56364e-06
...
)
;
    }
    rightWall
    {
        type            cyclic;
        value           nonuniform List<scalar> 
90
(
1.02835e-07
3.06755e-07
5.13447e-07
7.22235e-07
9.32394e-07
1.14318e-06
1.35385e-06
1.56364e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
