2023-07/deep-reinforcement-learning/RL_test_cases/rayleigh_benard_cell/physics-simulation-engine/fluid-openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.1)
    (6 0 -0.1)
    (6 2 -0.1)
    (0 2 -0.1)
    (0 0 0.1)
    (6 0 0.1)
    (6 2 0.1)
    (0 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 90 1) simpleGrading (1 10 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    leftWall
    {
      type              cyclic;
      neighbourPatch    rightWall;
      faces
      (
          (0 4 7 3)
      );
    }

    rightWall
    {
      type              cyclic;
      neighbourPatch    leftWall;
      faces
      (
          (2 6 5 1)
      );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
