2023-07/deep-reinforcement-learning/RL_test_cases/rayleigh_benard_cell/physics-simulation-engine/fluid-openfoam/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //