2023-07/deep-reinforcement-learning/RL_test_cases/rayleigh_benard_cell/physics-simulation-engine/fluid-openfoam/system/probes
// -*- C++ -*- //

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U T);

probeLocations
(
	(0.100000 0.100000 0.0)
	(0.300000 0.100000 0.0)
	(0.500000 0.100000 0.0)
	(0.700000 0.100000 0.0)
	(0.900000 0.100000 0.0)
	(1.100000 0.100000 0.0)
	(1.300000 0.100000 0.0)
	(1.500000 0.100000 0.0)
	(1.700000 0.100000 0.0)
	(1.900000 0.100000 0.0)
	(2.100000 0.100000 0.0)
	(2.300000 0.100000 0.0)
	(2.500000 0.100000 0.0)
	(2.700000 0.100000 0.0)
	(2.900000 0.100000 0.0)
	(3.100000 0.100000 0.0)
	(3.300000 0.100000 0.0)
	(3.500000 0.100000 0.0)
	(3.700000 0.100000 0.0)
	(3.900000 0.100000 0.0)
	(4.100000 0.100000 0.0)
	(4.300000 0.100000 0.0)
	(4.500000 0.100000 0.0)
	(4.700000 0.100000 0.0)
	(4.900000 0.100000 0.0)
	(5.100000 0.100000 0.0)
	(5.300000 0.100000 0.0)
	(5.500000 0.100000 0.0)
	(5.700000 0.100000 0.0)
	(5.900000 0.100000 0.0)
	(0.100000 0.300000 0.0)
	(0.300000 0.300000 0.0)
	(0.500000 0.300000 0.0)
	(0.700000 0.300000 0.0)
	(0.900000 0.300000 0.0)
	(1.100000 0.300000 0.0)
	(1.300000 0.300000 0.0)
	(1.500000 0.300000 0.0)
	(1.700000 0.300000 0.0)
	(1.900000 0.300000 0.0)
	(2.100000 0.300000 0.0)
	(2.300000 0.300000 0.0)
	(2.500000 0.300000 0.0)
	(2.700000 0.300000 0.0)
	(2.900000 0.300000 0.0)
	(3.100000 0.300000 0.0)
	(3.300000 0.300000 0.0)
	(3.500000 0.300000 0.0)
	(3.700000 0.300000 0.0)
	(3.900000 0.300000 0.0)
	(4.100000 0.300000 0.0)
	(4.300000 0.300000 0.0)
	(4.500000 0.300000 0.0)
	(4.700000 0.300000 0.0)
	(4.900000 0.300000 0.0)
	(5.100000 0.300000 0.0)
	(5.300000 0.300000 0.0)
	(5.500000 0.300000 0.0)
	(5.700000 0.300000 0.0)
	(5.900000 0.300000 0.0)
	(0.100000 0.500000 0.0)
	(0.300000 0.500000 0.0)
	(0.500000 0.500000 0.0)
	(0.700000 0.500000 0.0)
	(0.900000 0.500000 0.0)
	(1.100000 0.500000 0.0)
	(1.300000 0.500000 0.0)
	(1.500000 0.500000 0.0)
	(1.700000 0.500000 0.0)
	(1.900000 0.500000 0.0)
	(2.100000 0.500000 0.0)
	(2.300000 0.500000 0.0)
	(2.500000 0.500000 0.0)
	(2.700000 0.500000 0.0)
	(2.900000 0.500000 0.0)
	(3.100000 0.500000 0.0)
	(3.300000 0.500000 0.0)
	(3.500000 0.500000 0.0)
	(3.700000 0.500000 0.0)
	(3.900000 0.500000 0.0)
	(4.100000 0.500000 0.0)
	(4.300000 0.500000 0.0)
	(4.500000 0.500000 0.0)
	(4.700000 0.500000 0.0)
	(4.900000 0.500000 0.0)
	(5.100000 0.500000 0.0)
	(5.300000 0.500000 0.0)
	(5.500000 0.500000 0.0)
	(5.700000 0.500000 0.0)
	(5.900000 0.500000 0.0)
	(0.100000 0.700000 0.0)
	(0.300000 0.700000 0.0)
	(0.500000 0.700000 0.0)
	(0.700000 0.700000 0.0)
	(0.900000 0.700000 0.0)
	(1.100000 0.700000 0.0)
	(1.300000 0.700000 0.0)
	(1.500000 0.700000 0.0)
	(1.700000 0.700000 0.0)
...
);

// ************************************************************************* //
